## Задание 1

In [1]:
import pandas as pd

In [256]:
data_ratings = pd.read_csv('ratings.csv')

In [6]:
data_ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [9]:
def class_raiting(param):
    if param <= 2:
        return 'низкий рейтинг'
    elif param <= 4:
        return 'средний рейтинг'
    return 'высокий рейтинг'

In [10]:
data_ratings['class'] = data_ratings['rating'].apply(class_raiting)

In [16]:
data_ratings.head()

   userId  movieId  rating   timestamp            class
0       1       31     2.5  1260759144  средний рейтинг
1       1     1029     3.0  1260759179  средний рейтинг
2       1     1061     3.0  1260759182  средний рейтинг
3       1     1129     2.0  1260759185   низкий рейтинг
4       1     1172     4.0  1260759205  средний рейтинг

## Задание 2

In [46]:
data = pd.read_csv('keywords.csv')

In [123]:
dict_region = {'Центр': ['москва', 'тула', 'ярославль'], \
    'Северо-Запад': ['петербург', 'псков', 'мурманск'], \
    'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']}

def region(param):
    for region in dict_region:
        for city in dict_region[region]:
            if city.lower() in param:
                return region

    return 'undefined'

In [124]:
data['region'] = data['keyword'].apply(region)

In [125]:
data[ data.region == 'Центр' ].head()

               keyword   shows region
127       авито москва  979292  Центр
849    авито ярославль  209581  Центр
1259            москва  153050  Центр
1396   гисметео москва  140279  Центр
1482  госуслуги москва  133061  Центр

## Задание 3

In [257]:
data_movies = pd.read_csv('movies.csv')

In [258]:
data_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [259]:
years = []
for i in range(1950, 2011):
    years.append(str(i))

In [260]:
def production_year(param):
    for year in years:
        if year in param:
            return year
    return '1900'

In [261]:
data_movies['year'] = data_movies['title'].apply(production_year)

In [262]:
data_movies.head()

,movieId,title,genres,year
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji (1995),Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

In [263]:
def groupby_function(data):
    return data['rating'].mean()

In [264]:
movie_rating = data_ratings.groupby('movieId').apply(groupby_function)

In [266]:
movie_rating.head()

movieId
1    3.872470
2    3.401869
3    3.161017
4    2.384615
5    3.267857
dtype: float64

In [270]:
def add_column(param):
    for i in range(len(movie_rating)):
        if movie_rating.index[i] == param:
            return movie_rating[param]

In [271]:
data_movies['rating'] = data_movies['movieId'].apply(add_column)

In [277]:
def groupby_function(data):
    return data['rating'].mean()

In [278]:
data_movies.groupby('year').apply(groupby_function).sort_values(ascending=False)

year
1951    3.906653
1952    3.802318
1962    3.772962
1953    3.738878
1957    3.693322
          ...
2002    3.191918
1997    3.183169
1990    3.166759
2003    3.154081
2001    3.133080
Length: 62, dtype: float64